app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 4], ["post_id", 3], ["post_id", 2]]
---
            <div>
              <% post.recent_comments.includes([:author]).each do |comment| %>