app/views/posts/show.html.erb

    <div class="comment_holder">
    <% @post.recent_comments.each do |comments| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

    <h5>All comments</h5>
    <% @post.all_comments.each do |comments| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]