app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE (1) LIMIT $1  [["LIMIT", 1]]
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" LIMIT $1  [["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4)  [["post_id", 1], ["post_id", 4], ["post_id", 3], ["post_id", 2]]
---
  def index
    @user = User.find_by(params[:id])
    @posts = @user.posts.includes(:comments)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])